@echo off
setlocal
set curDIR=%CD%
:: Секция объявления (4-5-6 строк) чтобы сдвинуть вниз начальные сообщения
:: т.к. эта область начального сообщения будет закрываться полосой PowerShell
echo =======================================================================================================
echo Этот скрипт скачает и установит очень интересное приложение
echo              от фирмы -= Рога и копыта =-
echo =======================================================================================================
echo Убедись, что в этой папке ничего нужного нет, иначе все будет перезаписано вновь скачанными файлами!!!
echo Нажмите любую клавишу для продолжения
echo Для прекращения работы просто закройте это окно нажатием на "крестик".
echo =======================================================================================================
pause
:: Секция скачивания
echo Скачиваем git...
powershell -c "Invoke-WebRequest 'https://github.com/Nestorchik/git/releases/download/git_portable/git.zip' -OutFile 'git.zip'"
echo Готово
echo =======================================================================================================
echo Скачиваем Python...
powershell -c "Invoke-WebRequest 'https://github.com/Nestorchik/python_embeded/releases/download/python_embeded/python_embeded.zip' -OutFile 'python_embeded.zip'"
echo Готово
::
:: Секция разархивации
echo =======================================================================================================
echo Разархивируем git...
powershell -c "Expand-Archive -Force 'git.zip' 'git_portable_free_name_folder'"
echo Готово
echo =======================================================================================================
echo Разархивируем Python
powershell -c "Expand-Archive -Force 'python_embeded.zip' 'python_portable_free_name_folder'"
echo Готово
:: Не забудьте добавить в PATH пути на скачанное
:: set GIT_EXEC_PATH=%curDir%\git\bin;%curDir%\git\libexec;%curDir%\git\libexec\git-core
::
:: Секция удаления временных файлов
echo =======================================================================================================
echo Удалем временные файлы
if exist "git.zip" del /f /q "git.zip"
if exist "python_embeded.zip" del /f /q "python_embeded.zip"
echo Готово
echo =======================================================================================================
:: если не надо ждать нажатия клавиши для завершения работы (чтобы можгно было что-то почитать с экрана)
:: закоментировать или удалить "pause"
pause
:: и выход с тегом "/b" чтобы вернуться в вызывающий файл если вызваны по "call"
exit /b