@echo off
chcp 1251 >nul
echo ========================================================================================================
echo              Этот скрипт скачает и установит в текущую папку GIT-версию ComfyUI
echo                         установит все пакеты питона для карт NVIDIA
echo                         и сгенерирует файл запуска интерфейса ComfyUI 
echo                         ---------------------------------------------  
echo                        Убедись, что в этой папке ничего нужного нет,
echo                  иначе все будет перезаписано вновь скачанными файлами!!!
echo                  --------------------------------------------------------
echo                          Убедитесь, что ваш GIT находится в PATH
echo                     Измените путь к питону "python=c:\p312\python.exe"
echo                   на актуальный полный путь к вашему питону в строке 23.
echo                       Допустимые версии питона - 3.10, 3.11 или 3.12
echo                  --------------------------------------------------------
echo               Для прекращения работы просто закройте это окно нажатием на "крестик"!
echo ========================================================================================================
pause
setlocal
cls
echo
:: Измените в следующей строке путь к вашему питону. 
set python=c:\p312\python.exe
set startDir=%CD%
set comfy=%startDir%\ComfyUI
set venv=%comfy%\venv
set scripts=%venv%\Scripts
echo ========================================================================================================
echo Скачиваем "ComfyUI"
echo ========================================================================================================
git clone https://github.com/comfyanonymous/ComfyUI.git
echo ========================================================================================================
echo Установка VENV для ComfyUI
%python% -m venv %venv%
echo ========================================================================================================
echo Обновление версии PIP
%scripts%\python -m pip install --upgrade pip
echo ========================================================================================================
echo Скачивание и установка пакета TORCH-CUDA124
%scripts%\python -m pip install torch torchvision torchaudio --index-url https://download.pytorch.org/whl/cu124
echo ========================================================================================================
echo Установка пакетов питона "ComfyUI"
%scripts%\python -m pip install -r %comfy%\requirements.txt
echo ========================================================================================================
echo Установка "ComfyUI-Manager"
cd %comfy%\custom_nodes
git clone https://github.com/ltdrdata/ComfyUI-Manager.git
cd %startDir%
echo ========================================================================================================
echo Установка пакетов питона "ComfyUI-Manager"
%scripts%\python -m pip install -r %comfy%\custom_nodes\ComfyUI-Manager\requirements.txt
cd %startDir%
echo ========================================================================================================
echo Строим и записываем bat-файл...
echo @echo off>run.bat
echo setlocal>>run.bat
echo cd /d %~dp0 >>run.bat
echo %scripts%\python -s %comfy%\main.py --windows-standalone-build >> run.bat
echo ========================================================================================================
echo Установка завершена
echo ========================================================================================================
echo Не забудьте разместить модели в папке "ComfyUI\models\checkpoints"
echo или установите "SymLinkCreator" для создания сим-линков
echo на существующие модели в вашем репозитории.
echo https://github.com/Nestorchik/SymLinkCreator.git
echo ==================================
echo Запуск "ComfyUI"
echo ==================================
echo
echo Запуск "ComfyUI" на адресе http://127.0.0.1:8188
echo
%scripts%\python -s %comfy%\main.py --windows-standalone-build
pause


